# -*- org-confirm-babel-evaluate: nil -*- 
#+title:     A Cunning Plan
#+author:    
#+subtitle:   The Lambda Calculus, Lisp, Scheme, and R
#+date:    
#+language:   en
#+options:    H:2 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+options:    TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc

#+startup: beamer
#+latex_class: beamer
#+beamer_frame_level: 2
#+latex_class_options: [9pt]

#+latex_header:  \mode<beamer>{\usetheme[progressbar=frametitle]{metropolis}}
#+latex_header:  \usepackage{minted}
#+latex_header:  \usemintedstyle{colorful}
#+latex_header:  \usepackage[linesnumbered,ruled]{algorithm2e}
#+options:       tex:imagemagick
#+bind:          org-latex-image-default-width 0.5\linewidth $
#+bind:          org-latex-prefer-user-labels t

#+include:       /home/tharte/dot/include/newcommands.tex src latex
#+latex_header:  \newtheorem{defn}{Definition}[section]
#+latex_header:  \newtheorem{remark}{Remark}[section]
#+latex_header:  \usetikzlibrary{positioning}
#+latex_header:  \usetikzlibrary{shadows}
#+latex_header:  \usetikzlibrary{arrows}
#+latex_header:  \usetikzlibrary{matrix}

#+latex_header:  \usepackage{syntax}
#+latex_header:  \usepackage{textgreek}
#+latex_header:  \usepackage[makeroom]{cancel}

#+latex_header:  \definecolor{lightgreen}{HTML}{90EE90}
#+latex_header:  \definecolor{lightblue}{rgb}{0.94,0.94,0.95}

# make the counter algocf overlay aware (e.g. when using algorithm2e with onslide)
# Source:    https://tex.stackexchange.com/questions/226929/making-algorithm2e-environments-overlay-aware-in-beamer
#+latex_header:  \resetcounteronoverlays{algocf}

#+latex_header: \author{Thomas P.~Harte}
#+latex_header: \institute{R/Finance 2024-05-18 \\ University of Illinois at Chicago}

# Source: https://tex.stackexchange.com/questions/132783/how-to-write-checkmark-in-latex
#+latex_header:  \def\checkmark{\textcolor{green}{\tikz\fill[scale=0.4](0,.35) -- (.25,0) -- (1,.7) -- (.25,.15) -- cycle;}}

** Fibonacci: Lisp
#+begin_src emacs-lisp :exports both :results output :eval yes
(defun fibonacci (n)
    (if (or (= n 0) (= n 1)) n
	(+ (fibonacci (- n 1)) (fibonacci (- n 2)))))

(let ((x '(0 1 2 3 4 5 6 7 8 9 10)))
(mapcar (lambda (x) (princ (format "%2s:%+3s\n" x (fibonacci x)))) x))
#+end_src

#+RESULTS:
#+begin_example
 0:  0
 1:  1
 2:  1
 3:  2
 4:  3
 5:  5
 6:  8
 7: 13
 8: 21
 9: 34
10: 55
#+end_example

** Functions
- Mathematics
  
  $$x \mapsto x^2$$

- \onslide<2-> Haskell

    #+begin_src haskell :exports both :results output :eval no
    (\x -> x^2) 3
    #+end_src

    #+RESULTS:
    : 9

- \onslide<3-> R

    #+begin_src R :session *R* :exports both :results output :eval no
    (\(x) x^2) (3)
    #+end_src

    #+RESULTS:
    : [1] 9

** Functions
- Mathematics
  
  $$x \mapsto x^2$$

- Haskell

    #+begin_src haskell :exports both :results output :eval no
    (\x -> x^2) 3
    #+end_src

    #+RESULTS:
    : 9

- R

    #+begin_src R :session *R* :exports both :results output :eval no
    (function(x) x^2) (3)
    #+end_src

    #+RESULTS:
    : [1] 9

** Haskell: ~Int~
- Mathematics: constrain $x$
  
  $$f: x \mapsto x^2,\quad\forall x\in\ZZ$$

- \onslide<2-> type is metadata

    #+begin_src haskell :exports both :results output :eval no
    :{
      f :: Int -> Int
      f = \x -> x^2
    :}
    f 3
    #+end_src

    #+RESULTS:
    : 9

** Haskell: ~Double~
- Mathematics: constrain $x$
  
  $$f : x \mapsto x^2,\quad\forall x\in\RR$$

- \onslide<2-> type is metadata

    #+begin_src haskell :exports both :results output :eval no
    :{
      f :: Double -> Double
      f = \x -> x^2
    :}
    f 3.0
    #+end_src

    #+RESULTS:
    : 9.0

** Haskell: ~Num~
- Mathematics: what if there is no constraint on $x$?
  
  $$x \mapsto x^2,\quad\forall x\in\;???$$

- \onslide<2-> Haskell infers type

    #+begin_src haskell :exports both :results output :eval no
    :type \x -> x^2
    #+end_src

    \pause
    
    #+RESULTS:
    : \x -> x^2 :: Num a => a -> a

- \onslide<3-> type is metadata

    #+begin_src haskell :exports both :results output :eval no
    :{
      f :: Num a => a -> a
      f x = x^2
    :}
    f 3
    #+end_src

    #+RESULTS:
    : 9

** What if we /only/ had anonymous functions? (no /function names/)
- Mathematics
  
  $$x \mapsto x^2$$

- R

    #+begin_src R :session *R* :exports both :results output :eval no
    (\(x) x^2) (3)
    #+end_src

    #+RESULTS:
    : [1] 9

** What if we /only/ had anonymous functions? (no /numerals/...)
- Mathematics
  
  $$x \mapsto x$$

- R

    #+begin_src R :session *R* :exports both :results output :eval no
    \(x) x
    #+end_src

    #+RESULTS:
    : \(x) x

** Verify that branching works
\onslide<2-> 
#+begin_src R :session :exports both :results output :eval no
IF(true)(\(a) a)(\(b) b) 
#+end_src

#+RESULTS:
: \(a) a

\onslide<3-> 
#+begin_src R :session :exports both :results output :eval no
IF(false)(\(a) a)(\(b) b) 
#+end_src

#+RESULTS:
: \(b) b

** Switching between worlds: ~.to.logical~
\onslide<2-> 
#+begin_src R :session :exports both :results output :eval no
.to.logical
#+end_src

#+RESULTS:
: function (b) 
: (IF(b)(TRUE))(FALSE)
: <bytecode: 0x55fc452616e0>
: <environment: namespace:al>

\onslide<3-> 
#+begin_src R :session :exports both :results output :eval no
true |> .to.logical()
#+end_src

#+RESULTS:
: [1] TRUE

\onslide<4-> 
#+begin_src R :session :exports both :results output :eval no
false |> .to.logical()
#+end_src

#+RESULTS:
: [1] FALSE

** Logic: And 
    \onslide<2-> 
    $${\tt and} \bydefn \lambda x\lambda y.xyF$$

    \onslide<3-> 
    $$xyF \betared (FT)F \betared F$$

    \onslide<4-> 
    \vspace{-.5cm}
    $$xyF \betared (FF)F \betared F$$

    \onslide<5-> 
    \vspace{-.5cm}
    $$xyF \betared (TF)F \betared F$$

    \onslide<6-> 
    \vspace{-.5cm}
    $$xyF \betared (TT)F \betared T$$

    \onslide<7-> 
    #+begin_src R :session :exports both :results output :eval no
    and(false)(true) |> .to.logical()
    and(false)(false) |> .to.logical()
    and(true)(false) |> .to.logical()
    and(true)(true) |> .to.logical()
    #+end_src

    #+RESULTS:
    : [1] FALSE
    : [1] FALSE
    : [1] FALSE
    : [1] TRUE

** Logic: Or
    \onslide<2-> 
    $${\tt or} \bydefn \lambda x\lambda y.xTy$$

    \onslide<3-> 
    $$xTy \betared (F)T(T) \betared T$$

    \onslide<4-> 
    \vspace{-.5cm}
    $$xTy \betared (F)T(F) \betared F$$

    \onslide<5-> 
    \vspace{-.5cm}
    $$xTy \betared (T)T(F) \betared T$$

    \onslide<6-> 
    \vspace{-.5cm}
    $$xTy \betared (T)T(T) \betared T$$

    \onslide<7-> 
    #+begin_src R :session :exports both :results output :eval no
    or(false)(true) |> .to.logical()
    or(false)(false) |> .to.logical()
    or(true)(false) |> .to.logical()
    or(true)(true) |> .to.logical()
    #+end_src

    #+RESULTS:
    : [1] TRUE
    : [1] FALSE
    : [1] TRUE
    : [1] TRUE

** Logic: Not
    \onslide<2-> 
    $${\tt not} \bydefn pFT$$

    \onslide<3-> 
    $$pFT \betared (F)FT \betared T$$

    \onslide<4-> 
    \vspace{-.5cm}
    $$pFT \betared (T)FT \betared F$$

    \onslide<5-> 
    #+begin_src R :session :exports both :results output :eval no
    not(false) |> .to.logical()
    not(true) |> .to.logical()
    #+end_src

    #+RESULTS:
    : [1] TRUE
    : [1] FALSE

** Switching between worlds: ~.to.integer~
\onslide<2-> 
#+begin_src R :session :exports both :results output :eval no
.to.integer
#+end_src

#+RESULTS:
: function (n) 
: n(function(x) x + 1)(0)
: <bytecode: 0x55fc442ceef0>
: <environment: namespace:al>

\onslide<3-> 
#+begin_src R :session :exports both :results output :eval no
C0 |> .to.integer()
C1 |> .to.integer()
C2 |> .to.integer()
C3 |> .to.integer()
#+end_src

#+RESULTS:
: [1] 0
: [1] 1
: [1] 2
: [1] 3

